{
    "Q1": "If a friend of mine had a __personality conflict__ with a mutual acquaintance of ours and I thought it was important for them to get along, I would:",
    "Q1a": "Tell my friend that I felt s/he was partially responsible for any problems with this other person and try to let him/her know how the person was being affected by him/her.",
    "Q1b": "Not get involved because I wouldn’t be able to continue to get along with both of them once I had entered into their conflict in any way.",

    "Q2": "If one of my friends and I had a heated argument in the past and I realized that s/he was ill at ease around me from that time on, I would:",
    "Q2a"   : "Just let the whole thing drop to avoid making things worse by discussing it.",
    "Q2b"   : "Bring up his/her behavior and ask how s/he felt the argument had affected our relationship.",

    "Q3"    :  "If a friend began to avoid me and act in an aloof and withdrawn manner, I would:",
    "Q3a"   : "Tell him/her about his/her behavior and suggest that s/he tell me what was on his/her mind.",
    "Q3b"   : "Follow his/her lead & keep our contact brief & aloof since that seems to be what s/he wants.",

    "Q4"    : "If two of my friends and I were talking and one of them slipped and brought up a personal problem of mine that involved the other friend, of which s/he was not yet aware, I would:",
    "Q4a"   : "Change the subject and signal my friend to do the same.",
    "Q4b"   : "Briefly explain what the other friend was talking about and suggest that we go into it later.",

    "Q5"    : "If a friend of mine were to tell me that, in his/her opinion, I was doing things that made me less effective than I might be in social situations, I would:",
    "Q5a"   : "Ask him/her to describe what s/he has observed and suggest changes I might make.",
    "Q5b"   : "Resent his/her criticism and let him/her know why I behave the way I do.",

    "Q6"    : "If one of my friends aspired to an office in our organization for which I felt s/he was unqualified, and if s/he had been tentatively assigned to that position by the leader of our group, I would:",
    "Q6a"   : "Not mention any misgivings to either my friend or the leader of our group and let them handle it in their own way.",
    "Q6b"   : "Tell my friend and the group leader of my misgivings and leave the final decision to them.",

    "Q7"    : "If I felt that one of my friends was being unfair to me and his/her other friends, but none of the other friends had mentioned anything about it, I would:",
    "Q7a"   : "Ask the other friends how they perceive the situation to see if they felt s/he was being unfair.",
    "Q7b"   : "Not ask the others how they perceive our friend, but wait for them to bring it up with me.",

    "Q8"    : "If I were preoccupied with some personal matters and a friend told me that I had become irritated with him/her and others and that I was jumping on him/her for unimportant things, I would:",
    "Q8a"   : "Tell him/her I was preoccupied and would probably be on edge for a while.",
    "Q8b"   : "Listen to his/her complaints but not explain myself to him/her.",

    "Q9"    : "If I had heard some friends discussing an ugly rumor about a friend of mine which I knew could hurt him/her and s/he asked me what I knew about it, if anything, I would:",
    "Q9a"   : "Say I didn’t know anything and tell him/her our friends wouldn’t believe ugly rumors anyway.",
    "Q9b"   : "Tell him/her exactly what I had heard, when I had heard it, and from whom I had heard it.",

    "Q10"   : "If a friend pointed out that I had a personality conflict with another friend with whom it was important for me to get along, I would:",
    "Q10a"  : "Consider his/her comments out of line and tell him/her I didn’t want to discuss the matter.",
    "Q10b"  : "Talk about it openly with him/her to find out how my behavior was being affected by this.",

    "Q11"   : "If my relationship with a friend has been damaged by repeated arguments on an issue of importance to us both, I would:",
    "Q11a"  : "Be cautious in my conversations with him/her so the issue would not come up again to worsen our relationship.",
    "Q11b"  : "Explain the problems the controversy is causing for our relationship and suggest that we discuss it until we get it resolved.",

    "Q12"   : "If in a conversation with a friend about his/her personal problems and behavior s/he suddenly suggested we discuss my problems and behavior as well as his/her own, I would:",
    "Q12a"  : "Be evasive and try to keep the discussion away from me.",
    "Q12b"  : "Welcome the opportunity to hear what s/he felt about me and encourage his/her comments.",

    "Q13"   : "If a friend of mine began to tell me about his/her hostile feelings about another friend whom s/he felt was being unkind to others (and I agreed wholeheartedly), I would:",
    "Q13a"  : "Listen and also express my own feelings to her/him so s/he would know where I stood.",
    "Q13b"  : "Listen, but not express my own negative views and opinion because s/he might repeat what I said in confidence.",

    "Q14"   : "If I thought an ugly rumor was being spread about me and suspected that one of my friends had quite likely heard it, I would:",
    "Q14a"  : "Avoid mentioning the issue and leave it to him/her to tell me about it if s/he wanted to.",
    "Q14b"  : "Risk putting him/her on the spot by asking directly what s/he knew about the rumor.",

    "Q15"   : "If had observed a friend in social situations and thought that s/he was doing a number of things which hurt his/her relationships, I would:",
    "Q15a"  : "Risk being seen as a busy-body and tell him/her what I had observed and my reactions to it.",
    "Q15b"  : "Keep my opinion to myself rather than be seen as interfering in what is none of my business.",


    "Q16"   : "If two friends and I were talking and one of them inadvertently mentioned a personal problem which involved me, but of which I knew nothing, I would:",
    "Q16a"  : "Press them for information about the problem and their opinions on it.",
    "Q16b"  : "Leave it up to my friends to tell me or not, letting them change the subject if they wished.",

    "Q17"   : "If a friend seemed to be preoccupied and began to jump on me for seemingly unimportant things, as well as others without real cause, I would:",
    "Q17a"  : "Treat him/her with kid gloves for a while on the assumption that s/he was having some temporary personal problems which were none of my business.",
    "Q17b"  : "Try to talk to him/her about it and explain how his/her behavior was affecting others.",

    "Q18"   : "If I had begun to dislike certain habits of a friend to the point that it was interfering with my enjoyment of their company, I would:",
    "Q18a"  : "Say nothing to him/her directly, but let him/her know my feelings by ignoring him/her whenever the annoying habits were obvious.",
    "Q18b"  : "Get my feelings out in the open and clear the air so that we could continue our friendship comfortably and enjoyably.",

    "Q19"   : "In discussing social behavior with one of my more sensitive friends, I would:",
    "Q19a"  : "Avoid mentioning his/her flaws and weaknesses so as not to hurt his/her feelings.",
    "Q19b"  : "Focus on his/her flaws and weaknesses so s/he could improve his/her interpersonal skills.",

    "Q20"   : "If I knew my friends’ attitudes toward me had become rather negative lately and I knew I might be assigned an important position in our group, I would:",
    "Q20a"  : "Discuss my shortcomings with my friends so I could see where to improve.",
    "Q20b"  : "Try to figure out my own shortcomings by myself so I could improve."
}